msvirchevskyi/Secure_Esp8266_Signalization_Public/src/main.cpp

//=========================БАЗОВІ НАЛАШТУВАННЯ=================

//РОЛЬ=експериментальний модуль
#define S_version 2.12
#define comp_date __DATE__
#define eeprom_size 512
#define ONE_WIRE_BUS_PIN 4
#define led_in_pin 2
#define sensor_in_pin 16
#define relay_in_pin 5
#define battery_in_pin A0
#define zoomer_pin 15
#define wifi_off_pin 14
#define ap_mode_pin 12
#define interrupt_pin 13

//=========================ПІДКЛЮЧЕННЯ БІБЛІОТЕК===============

//підключення бібліотек
#include <Arduino.h>
#include <OneWire.h>
#include <DallasTemperature.h>
#include <ESP8266WiFi.h>
#include <EEPROM.h>                          
#include <ESP8266HTTPClient.h>
#include <ESP8266WebServer.h>
#include <WiFiUdp.h>
#include <NTPClient.h>

//загальні для всіх підключення  
ESP8266WebServer Wserver(80);
WiFiClient gclient;
WiFiUDP ntpUDP;
NTPClient timeClient(ntpUDP, "ua.pool.ntp.org", 7200, 60000);
OneWire oneWire(ONE_WIRE_BUS_PIN);
DallasTemperature sensors(&oneWire);
DeviceAddress *sensorsUnique;

//=====================ОПИС КЛАСІВ=============================

//клас доступу до вбудованої памяті
class EEPROM_READ_WRITE{
  protected:
  int Adress,Size,startAdress = 0;
  public:
  EEPROM_READ_WRITE(int adr, int sz = 128, int startAdr = 0) {
    Adress=adr; Size=sz; startAdress=startAdr;
    }
  void SET_ADRESS(int Adr){
    Adress=Adr;
    }
  int EEPROM_READ_INT(){
    int ret = -1;
    EEPROM.begin(Size);   
    EEPROM.get(Adress+startAdress,ret);
    EEPROM.end();
    return ret;
    }
  char EEPROM_READ_CHAR(){
    char ret = -1;
    EEPROM.begin(Size);   
    EEPROM.get(Adress+startAdress,ret);
    EEPROM.end();
    return ret;
    }    
  bool EEPROM_READ_BOOL(){
    bool ret = false;
    EEPROM.begin(Size);   
    EEPROM.get(Adress+startAdress,ret);
    EEPROM.end();
    return ret;
    }    
  void EEPROM_WRITE_SV(auto ret){
    EEPROM.begin(Size);   
    EEPROM.put(Adress+startAdress,ret); 
    EEPROM.end();
    } 
  void EEPROM_WRITE_STRING (String Str) {
    byte lng=Str.length();
    int cIndex=Adress+startAdress;
    EEPROM.begin(Size);
    if (lng>128)  lng=128;
    EEPROM.write(cIndex,lng); 
    unsigned char* buf = new unsigned char[lng+2];
    Str.getBytes(buf,lng+1);
    cIndex++;
    for(byte i=0; i<lng; i++) {EEPROM.write(cIndex+i, buf[i]); delay(10);}
    EEPROM.end();
    } 
  char *EEPROM_READ_STRING () {
    int cIndex=Adress+startAdress;
    EEPROM.begin(Size);
    byte lng = EEPROM.read(cIndex);
    char* buf = new char[lng+2];
    cIndex++;
    for(byte i=0; i<lng; i++) buf[i] = char(EEPROM.read(cIndex+i));
    buf[lng] = '\x0';
    EEPROM.end();
    return buf;
    }  
};

//підключення класу керування пінами
template <class S>
class device_one_pin{
  protected:
  S pinIn;
  char pinMod; 
  volatile int  digitalStatus, analogStatus, delayStatus = 0;
  volatile bool enabled, digWrite, anWrite ,isAnalog = false;
  public:
  device_one_pin (S pin, char pMod = 'O', bool an = false) {
    pinIn=pin; pinMod=pMod; isAnalog=an;
    }
  bool enable(){
    if (isAnalog==false) {
    if (pinMod=='I') {pinMode(pinIn,INPUT); enabled=true;}
    if (pinMod=='P') {pinMode(pinIn,INPUT_PULLUP); enabled=true;}
    if (pinMod=='O') {pinMode(pinIn,OUTPUT); enabled=true;}
    } else {
      if (pinMod=='I') {pinMode(A0,INPUT); enabled=true;}
      if (pinMod=='P') {pinMode(A0,INPUT_PULLUP); enabled=true;}
      if (pinMod=='O') {pinMode(A0,OUTPUT); enabled=true;}      
      } 
    return enabled;
    }    
  bool eStatus() {
    return enabled;   
    }
  int dStatus(){
    return digitalStatus;
    }
  int aStatus(){
    analogStatus=analogRead(A0);
    return analogStatus;
    }
  void SetDelay(bool state = false, int del = 100){
    digWrite=state;
    if (del>delayStatus) {delayStatus=del;}
    }  
  void DelayTick(){
    if (delayStatus>=0){
      delayStatus=delayStatus-1;
      digitalWrite(pinIn,digWrite);
      }      
    if (delayStatus==0){
      digWrite=!digWrite; 
      digitalWrite(pinIn,digWrite);
      }    
    }  
  void ReadPin() {
    digitalStatus=digitalRead(pinIn);
    analogStatus=analogRead(pinIn);
    }  
  void dWrite0(){  
    if (enabled==true){
      digWrite=0;
      digitalWrite(pinIn,digWrite);}
    }  
  void dWrite1(){ 
    if (enabled==true){
      digWrite=1;
      digitalWrite(pinIn,digWrite);}
    }  
  void dWrite(int bin){ 
    if (enabled==true){
      digWrite=bin;
      digitalWrite(pinIn,digWrite);}
    }
  void aWrite(int bin){  
    if (enabled==true){
      anWrite=bin;
      digitalWrite(pinIn,anWrite);}
    }
  void dWriteReverse(){   
    if (enabled==true){
      digWrite=!digWrite;
      digitalWrite(pinIn,digWrite);}
    } 
  void buzzie(int hz,int td=-1){
    if (td<1) {tone(pinIn,hz);} else {tone(pinIn,hz,td);}  
    }
  void dWriteReverseAndDelay(int del){   
    if (enabled==true){
      digWrite=!digWrite;
      digitalWrite(pinIn,digWrite);
      delay(del); 
      }
    }     
  double backVolts (double nVolts = 3.3){
    double vStatus = 0;
    analogStatus=analogRead(A0);
    if (enabled==true){vStatus=(nVolts/1024)*analogStatus;}
    return vStatus;
    }     
  };

//клас створення таймерів
template <class A>
class tTimer{
  protected:
  A (*fnc)() = NULL;
  unsigned long timer_interval, timer_now = 0;
  bool enabled = false;
  public:
  tTimer(unsigned long interval, bool enable = true, A (*cFcn)() = NULL){
    timer_interval=interval;
    enabled=enable;
    fnc=cFcn;
  }
  void Tick(){
    if ((micros() - timer_now > timer_interval) and (enabled==true)) { 
    timer_now = micros(); 
    fnc();   
    }
  }
  bool tEnabled(){
    return enabled;
  }
  void isEnable(bool en){
    enabled=en;
    }
  void setInterval(unsigned long i){
    timer_interval=i;
    }  
  }; 

//=====================ОБЯВЛЕННЯ ФУНКЦІЙ============================

void time_flow_0();
void time_flow_1();
void time_flow_2();
void time_flow_3();
void time_flow_4();
void setup();
void loop();
int sendmesage(String mes, String url_key, bool std_message = false);
bool connect_to_wifi(String sid,String pid,int rep);

