msvirchevskyi/Secure_Esp8266_Signalization_Public/src/main.cpp
//=====================ОБЯВЛЕННЯ ОБЕКТІВ============================

//0,8,16,24,32,40,48,56,64...*8/*64
EEPROM_READ_WRITE eEPROM_max_rt(0,eeprom_size,0);
EEPROM_READ_WRITE eEPROM_sec_enable(8,eeprom_size,0);
EEPROM_READ_WRITE eEPROM_pass(16,eeprom_size,0);
EEPROM_READ_WRITE eEPROM_ssid(80,eeprom_size,0);
EEPROM_READ_WRITE eEPROM_web_url(144,eeprom_size,0);
EEPROM_READ_WRITE eEPROM_dev_id(272,eeprom_size,0);
EEPROM_READ_WRITE eEPROM_pass_ap(336,eeprom_size,0);
EEPROM_READ_WRITE eEPROM_ssid_ap(400,eeprom_size,0);
EEPROM_READ_WRITE eEPROM_sysok(408,eeprom_size,0);
EEPROM_READ_WRITE eEPROM_alert(416,eeprom_size,0);
EEPROM_READ_WRITE eEPROM_fire(424,eeprom_size,0);
EEPROM_READ_WRITE eEPROM_crTemp(432,eeprom_size,0);

EEPROM_READ_WRITE ep_saved_pass(440,eeprom_size,0);
EEPROM_READ_WRITE ep_relay_time_on_HR(472,eeprom_size,0);
EEPROM_READ_WRITE ep_relay_time_on_MINS(476,eeprom_size,0);
EEPROM_READ_WRITE ep_relay_time_off_HR(480,eeprom_size,0);
EEPROM_READ_WRITE ep_relay_time_off_MINS(484,eeprom_size,0);

tTimer timer0(1,true,time_flow_0);
tTimer timer1(1*1000,true,time_flow_1);
tTimer timer2(1000*1000,true,time_flow_2); 
tTimer timer3(1000*1000,true,time_flow_3); 
device_one_pin led_in(led_in_pin,'O');
device_one_pin relay_in(relay_in_pin,'O');
device_one_pin zoomer(zoomer_pin,'O');
device_one_pin battery(battery_in_pin,'I',true); //ESP8266 A0 PIN
device_one_pin move_sensor(sensor_in_pin,'I');
device_one_pin wifi_enable(wifi_off_pin,'P');
device_one_pin ap_mode(ap_mode_pin,'P');

//=====================ГЛОБАЛЬНІ ЗМІННІ=============================

unsigned long system_unix_type = 0;
int max_relay_time,countSensors,alert,fireMsg,sysOk,INTERNET,session_timeout,c_t_sensors = 0;
volatile int relay_on_timer = 0;
String relay_setting="AUTO"; //on,auto,off
int last_power_state=0;
bool secure_status,connected_to_wifi,time_updated,zoomer_enabled,ap_test,ap_tested,soft_ap,p_sensor = false; 
String ssid_name,ssid_pass,ssid_name_ap,ssid_pass_ap,web_url,dev_id,web_message_out,temp_string,web_page_answer,text_time_line,tsn,tsp,unx_text_time_line = "";
String new_pass,user_pass,saved_pass="";
int relay_time_on_HR,relay_time_on_MINS,relay_time_off_HR,relay_time_off_MINS,ligth_up=0;
String page="home";   //home,main_settings
int wrong_password_inputs=10;
int sysOk_timeout=3600*8; 
int alert_timeout=60*10;
int fireMsg_timeout=60;
int critTemperature=65;
int INTERNET_TIMEOUT = 10;
float l_voltage=100;
float h_voltage=0;
float temperature[10],h_temperature;
int timers[6]; //sec,min,hour,days,mounth,year
int unx_timers[4] = {0,0,0,0};

//=====================ФУНКЦІЇ ЧАСУ=============================
void timecalculate_unx(){
unx_timers[0]++;
if (unx_timers[0]>59) {unx_timers[0]=0; unx_timers[1]++;}
if (unx_timers[1]>59) {unx_timers[1]=0; unx_timers[2]++;}
if (unx_timers[2]>23) {unx_timers[2]=0; unx_timers[3]++;}
unx_text_time_line=String(unx_timers[3])+"days /"+String(unx_timers[2])+":"+String(unx_timers[1])+":"+String(unx_timers[0]);  
}

//розбір змінних часу на частини,відлік часу
void timecalculate_ntp(){
  if (INTERNET_TIMEOUT>0 and time_updated==false) {timeClient.update(); time_updated=true;} 
  unsigned long epochTime = timeClient.getEpochTime();
  struct tm *ptm = gmtime ((time_t *)&epochTime);   
  timers[5]=ptm->tm_year+1900;
  timers[4]=ptm->tm_mon+1;
  timers[3]=ptm->tm_mday;
  timers[2]=timeClient.getHours();
  timers[1]=timeClient.getMinutes();
  timers[0]=timeClient.getSeconds(); 
  //INTERNET 
  INTERNET=false;
  if ((timers[5]>1970 and timers[5]<3000)){
    INTERNET=true;
    Serial.println("INTERNET!");
  } else {Serial.println("NO INTERNET!");}  
  if (INTERNET_TIMEOUT>0){INTERNET_TIMEOUT--; time_updated=false;}  
  text_time_line=String(timers[5])+"-"+String(timers[4])+"-"+String(timers[3])+"/"+String(timers[2])+":"+String(timers[1])+":"+String(timers[0]);
  } 

//=====================Елементи веб інтерфейсу=================

String add_button(String text = "", String link = "" ,String al=""){
  if (link!="") {
  if (al!="") {text="<a href="+link+"><button type=\"button\" align=\""+al+"\" >"+text+"</button></a>";} else {text="<a href="+link+"><button type=\"button\">"+text+"</button></a>";}
  } else {
    text="<button type=\"button\">"+text+"</button>";
    }
  return text;  
  }
  
String add_text_field(String label, String var_name, String T="", String L="" ,String al=""){
  String text = "";
  if (al!="") {text=text+"<form action=\"/\" align=\""+al+"\" >";} else {text=text+"<form action=\"/\">";}
  text=text+"<label for=\""+var_name+"\">"+label+"</label>";
  text=text+"<input type=\"text\" id=\""+var_name+"\" name=\""+var_name+"\"><br>";
  text=text+L;
  if (T!="") {text=text+"<input type=\"submit\" value="+T+">";} 
  text=text+"</form>";
  return text;    
}

String add_2text_field(String label1, String var_name1, String label2, String var_name2, String T="", String L1="", String L2="" ,String al=""){
  String text = "";
  if (al!="") {text=text+"<form action=\"/\" align=\""+al+"\" >";} else {text=text+"<form action=\"/\">";}
  text=text+"<label for=\""+var_name1+"\">"+label1+L1+"</label>";
  text=text+"<input type=\"text\" id=\""+var_name1+"\" name=\""+var_name1+"\"><br><br>";
  text=text+L1;
  text=text+"<label for=\""+var_name2+"\">"+label2+L2+"</label>";
  text=text+"<input type=\"text\" id=\""+var_name2+"\" name=\""+var_name2+"\"><br><br>"; 
  text=text+L2;
  text=text+"<input type=\"submit\" value="+T+">"; 
  text=text+"</form>";
  return text;    
}

//=====================Ввід команд============================= 

//прийом команд через порт
String serial_commands(String web_command = ""){
  String hta="";
  if ((Serial.available() > 0) or (web_command!="")) {
    String ts=Serial.readString()+web_command;
    Serial.println(">"+ts);
    if (ts=="/security=on") {eEPROM_sec_enable.EEPROM_WRITE_SV(true); secure_status=eEPROM_sec_enable.EEPROM_READ_BOOL();
      hta="security on";
      }
    if (ts=="/security=off") {eEPROM_sec_enable.EEPROM_WRITE_SV(false); secure_status=eEPROM_sec_enable.EEPROM_READ_BOOL();
      hta="security off";
      }   
    if (ts=="/reset") {ESP.restart();}
    if (ts.substring(0,11)=="/ssid_name=") {ssid_name=ts.substring(11,27); eEPROM_ssid.EEPROM_WRITE_STRING(ssid_name); ssid_name=eEPROM_ssid.EEPROM_READ_STRING();  
      hta="Set ssid_name:"+ssid_name;
      } 
    if (ts.substring(0,11)=="/ssid_pass=") {ssid_pass=ts.substring(11,27); eEPROM_pass.EEPROM_WRITE_STRING(ssid_pass); ssid_pass=eEPROM_pass.EEPROM_READ_STRING(); 
      hta="Set ssid_pass:"+ssid_pass;
      }
    if (ts.substring(0,9)=="/web_url=") {web_url=ts.substring(9,127); eEPROM_web_url.EEPROM_WRITE_STRING(web_url); web_url=eEPROM_web_url.EEPROM_READ_STRING(); 
      hta="Set web_key:"+web_url;
      } 
    if (ts.substring(0,8)=="/dev_id=") {dev_id=ts.substring(8,127); eEPROM_dev_id.EEPROM_WRITE_STRING(dev_id); dev_id=eEPROM_dev_id.EEPROM_READ_STRING();  
      hta="Set dev_id:"+dev_id;
      }
    if (ts.substring(0,7)=="/timer=") {max_relay_time=ts.substring(7,16).toInt(); eEPROM_max_rt.EEPROM_WRITE_SV(max_relay_time); max_relay_time=eEPROM_max_rt.EEPROM_READ_INT(); 
      hta="Set timer:"+String(max_relay_time);
      }
    if (ts=="/help") {Serial.println("Commands for user settings> /dev_id=, /timer=, /web_url=, /ssid_name=, /ssid_pass=, /reset");}
    Serial.println(hta);
    }   
  return hta;  
  }

//веб-сервер
void html_commands(){
  String ts,tts,tsx="";
  //обробка запитів
  if (Wserver.args()) {
    if (Wserver.arg("user_pass")!="" and wrong_password_inputs>0) { //user_pass
    user_pass=Wserver.arg("user_pass");
    }
  if (wrong_password_inputs==1){
    wrong_password_inputs=-1;
    sendmesage("TRY_BRUTFORCE",web_url,true);
  }
  if (user_pass==saved_pass){    
    if (Wserver.arg("page")!="") {
    page=Wserver.arg("page");
    }
    //--- 
    if (Wserver.arg("new_pass")!="") { //new_pass
    new_pass=Wserver.arg("new_pass");
    saved_pass=new_pass;
    user_pass=new_pass;
    ep_saved_pass.EEPROM_WRITE_STRING(new_pass);
    }     
    //---   
    if (Wserver.arg("relay_time_on_HR")!="") { //relay_time_on_HR
    relay_time_on_HR=Wserver.arg("relay_time_on_HR").toInt();
    ep_relay_time_on_HR.EEPROM_WRITE_SV(relay_time_on_HR);
    }
    if (Wserver.arg("relay_time_on_MINS")!="") { //relay_time_on_MINS
    relay_time_on_MINS=Wserver.arg("relay_time_on_MINS").toInt();
    ep_relay_time_on_MINS.EEPROM_WRITE_SV(relay_time_on_MINS);
    }
    if (Wserver.arg("relay_time_off_HR")!="") { //relay_time_off_HR
    relay_time_off_HR=Wserver.arg("relay_time_off_HR").toInt();
    ep_relay_time_off_HR.EEPROM_WRITE_SV(relay_time_off_HR);
    }
    if (Wserver.arg("relay_time_off_MINS")!="") { //relay_time_off_MINS
    relay_time_off_MINS=Wserver.arg("relay_time_off_MINS").toInt();
    ep_relay_time_off_MINS.EEPROM_WRITE_SV(relay_time_off_MINS);
    }
    if (Wserver.arg("security_on")!="") {
    tts=Wserver.arg("security_on");
    if (tts=="true" or tts=="1"){secure_status=true;  ts=ts+"secure mode on";} else {secure_status=false; ts=ts+"secure mode off";} 
    if (secure_status==true) {sendmesage("SSTATUS_ON",web_url,true); sysOk=sysOk_timeout;} else {sendmesage("SSTATUS_OFF",web_url,true);}
    eEPROM_sec_enable.EEPROM_WRITE_SV(secure_status);
    }
    if (Wserver.arg("zoomer_on")!="") {
    tts=Wserver.arg("zoomer_on");
    if (tts=="true" or tts=="1"){zoomer_enabled=true; ts=ts+"zoomer on";} else {zoomer_enabled=false; ts=ts+"zoomer off";}   
    }
    if (Wserver.arg("relay_mode")!="") {
    tts=Wserver.arg("relay_mode");
    if (tts=="ON" or tts=="1" or tts=="on"){relay_setting="ON";}
    if (tts=="AUTO" or tts=="0" or tts=="auto"){relay_setting="AUTO";}
    if (tts=="OFF" or tts=="-1" or tts=="off"){relay_setting="OFF";}
    }
    if (Wserver.arg("ssid_name")!="") {
    tsn=Wserver.arg("ssid_name");
    }
    if (Wserver.arg("ssid_pass")!="") {
    tsp=Wserver.arg("ssid_pass");
    }
    if (Wserver.arg("ssid_test")!="") {
    tts=Wserver.arg("ssid_test");
    if ((tts=="true" or tts=="1") and tsn!="" and tsp!=""){if (connect_to_wifi(tsn,tsp,600)==true){
      ap_test=true;
      ap_tested=true;
      connect_to_wifi(ssid_name,ssid_pass,600);
      } else {connect_to_wifi(ssid_name,ssid_pass,600); ap_test=false;} }   
    }  
  if (Wserver.arg("ssid_save")!="") {
    tts=Wserver.arg("ssid_save");
    if ((tts=="true" or tts=="1") and tsn!="" and tsp!="") {
      connect_to_wifi(tsn,tsp,600);
      eEPROM_ssid.EEPROM_WRITE_STRING(tsn);
      eEPROM_pass.EEPROM_WRITE_STRING(tsp);
      sendmesage("SSID_CHANGED",web_url,true);
      ESP.reset();
      } else {ts=ts+"SSID:required parameters!";}
    }
  if (Wserver.arg("web_url")!="") {
    tts=Wserver.arg("web_url");
    web_url=tts; ts=ts+"web_url changed:"+tts;
    eEPROM_web_url.EEPROM_WRITE_STRING(web_url);  
    }        
  if (Wserver.arg("dev_id")!="") {
    tts=Wserver.arg("dev_id");
    dev_id=tts; ts=ts+"dev_id changed:"+tts;
    eEPROM_dev_id.EEPROM_WRITE_STRING(dev_id);  
    } 
  if (Wserver.arg("relay_timer")!="") {
    tts=Wserver.arg("relay_timer");
    max_relay_time=tts.toInt(); ts=ts+"relay_timer changed:"+tts+"<br>";
    eEPROM_max_rt.EEPROM_WRITE_SV(max_relay_time);  
    }
  //--------------------------------
  if (Wserver.arg("sysok_timer")!="") {      
    tts=Wserver.arg("sysok_timer");
    sysOk_timeout=tts.toInt(); ts=ts+"sysOk_timeout changed:"+tts+"<br>";
    eEPROM_sysok.EEPROM_WRITE_SV(sysOk_timeout); 
    } 
  if (Wserver.arg("crittemp")!="") {      
    tts=Wserver.arg("crittemp");
    critTemperature=tts.toInt(); ts=ts+"critTemperature changed:"+tts+"<br>";
    eEPROM_crTemp.EEPROM_WRITE_SV(critTemperature);
    }  
    if (Wserver.arg("firemsg_timer")!="") {      
    tts=Wserver.arg("firemsg_timer");
    fireMsg_timeout=tts.toInt(); ts=ts+"fireMsg_timeout changed:"+tts+"<br>";
    eEPROM_fire.EEPROM_WRITE_SV(fireMsg_timeout);
    }
    if (Wserver.arg("alert_timer")!="") {      
    tts=Wserver.arg("alert_timer");
    alert_timeout=tts.toInt(); ts=ts+"alert_timeout changed:"+tts+"<br>";
    eEPROM_alert.EEPROM_WRITE_SV(alert_timeout);
    } 
  if (Wserver.arg("reset")=="true") {
    Wserver.send(200,"text/html",add_button("PLEASE WAITING WHILE REBOOTING...","/?page=home")); 
    ESP.reset();
    }
  if (Wserver.arg("logout")=="true") {
    user_pass="";
    }
  session_timeout=5*60;
  wrong_password_inputs=10;         
    } else {
      ts="Wrong password!"; 
      if (wrong_password_inputs>0){
        wrong_password_inputs--;
      } else {
        ts=ts+"Input blocked, Try later after reboot system!";
      }
    }
  }
  //===============================================================
  //формування сторінок 
  //при наявності повідомлення
  if (ap_test==true and ap_tested==true){ts="Test OK";}
  if (ap_test==false and ap_tested==true){ts="AP NOT Found";}
  if (ts!=""){
    ts="<p style=\"background-color:Orange;\" align=\"center\" >"+ts+"</p>";
    }  
  //заголовок сторінки
  ts=ts+"<title>"+dev_id+"</title>";
  ts=ts+"<p style=\"background-color:Orange; color:Blue;\" align=\"center\" >";
  ts=ts+"<b>"+dev_id+"</b>";
  ts=ts+"</p>";
  ts=ts+"<p style=\"background-color:MediumSeaGreen;\" align=\"center\" >";
  //префікс сторінки
  ts=ts+"System Time:"+unx_text_time_line+"| Sensor in:"+String(move_sensor.dStatus())+"| Relay timer:"+String(relay_on_timer)+"<br>";
  if (l_voltage!=0) {ts=ts+"Battery:"+String(battery.backVolts(3.2*3))+"V(minimum="+String(l_voltage)+")(maximum="+String(h_voltage)+")";} else {ts=ts+"Battery: N/C" ;}  
  if (c_t_sensors>0) {
    ts=ts+" | Temperatures:("+String(c_t_sensors)+")";
    ts=ts+" "+String(temperature[0]);
    for (int i=1; i<c_t_sensors; i++){
    ts=ts+", "+String(temperature[i]);   
    }} else {ts=ts+" | Temperature: N/C ";} 
  if (INTERNET==true){ts=ts+"<br> NTP Time:"+text_time_line+"<br>";} else {ts=ts+"<br> NTP Time:"+text_time_line+"[NO INTERNET]<br>";}
  if (relay_time_on_HR>=0 and relay_time_off_HR>=0 and relay_time_on_MINS>=0 and relay_time_off_MINS>=0){ts=ts+"AUTO ON TIMER:"+relay_time_on_HR+":"+relay_time_on_MINS+"-"+relay_time_off_HR+":"+relay_time_off_MINS+"<br>";}
  if (secure_status==true){ts=ts+"Security status=ON "; } else {ts=ts+"Security status=OFF "; }
  ts=ts+" | Relay status="+relay_setting;
  if (zoomer_enabled==true){ts=ts+" | Zoomer=ON <br>"; } else {ts=ts+" | Zoomer=OFF <br>"; }
  //soft_ap 
  if (soft_ap==false){ts=ts+"Active SSID:"+ssid_name; } else {ts=ts+"Active SSID(Soft AP MODE):"+ssid_name_ap; }
  ts=ts+"</p>";
if (user_pass==saved_pass){
  if (page=="home"){  //тіло сторінки домашньої
    ts=ts+"<p style=\"background-color:Yellow;\" align=\"center\" >";    
    ts=ts+add_button("security_on","/?security_on=1")+add_button("security_off","/?security_on=0")+"<br>";
    ts=ts+add_button("zoomer_on","/?zoomer_on=1")+add_button("zoomer_off","/?zoomer_on=0")+"<br>";
    ts=ts+add_button("relay_mode_on","/?relay_mode=on")+add_button("relay_mode_auto","/?relay_mode=auto")+add_button("relay_mode_off","/?relay_mode=off")+"<br><br>";
    ts=ts+add_button("Connection Settings","/?page=main_settings")+add_button("Clock Settings","/?page=clk_settings")+"<br>";
    ts=ts+add_button("Timer Settings","/?page=add_settings")+add_button("Security Settings","/?page=security_settings")+"<br>";
    ts=ts+add_button("ABOUT SYSTEM","/?page=pins_settings")+add_button("LOGOUT["+String(session_timeout)+"Seconds]","/?logout=true")+"<br><br>";
    ts=ts+add_button("RESET","/?reset=true")+"<br>";
    ts=ts+"</p>";
    }
  if (page=="main_settings"){  //тіло сторінки настройок
    ts=ts+add_2text_field("SSID:","ssid_name","PASS:","ssid_pass","Send");
    if (tsn!="" and tsp!="") {ts=ts+"New AP Settings received: SSID="+tsn+" PASS=******** <br>";}
    ts=ts+add_button("Ssid_TEST","/?ssid_test=true")+add_button("Enable_and_REBOOT","/?ssid_save=true")+"<br><br>";
    ts=ts+"Current URL:"+web_url+"<br>";
    ts=ts+add_text_field("WEB_URL:","web_url","Save")+"<br><br>"; 
    ts=ts+"Current ID:"+dev_id+"<br>";
    ts=ts+add_text_field("Dev_id:","dev_id","Save")+"<br><br>"; 
    ts=ts+add_button("To Main","/?page=home")+"<br>";
    }
  if (page=="add_settings"){  //тіло сторінки додаткових настройок 
    ts=ts+"Current RT:"+String(max_relay_time)+"Second <br>"; 
    ts=ts+add_text_field("Relay_timer:","relay_timer","Save")+"<br><br>"; 
    ts=ts+"Current SysOK timeout:"+String(sysOk_timeout)+"Second <br>"; 
    ts=ts+add_text_field("SysOK_timer:","sysok_timer","Save")+"<br><br>";
    ts=ts+"Current Alert timeout:"+String(alert_timeout)+"Second <br>"; 
    ts=ts+add_text_field("Alert_timer:","alert_timer","Save")+"<br><br>";    
    ts=ts+"Current fireMsg timeout:"+String(fireMsg_timeout)+"Second <br>"; 
    ts=ts+add_text_field("fireMsg_timer:","firemsg_timer","Save")+"<br><br>";
    ts=ts+"Current critical Temperature:"+String(critTemperature)+"'C <br>"; 
    ts=ts+add_text_field("CritTemp:","crittemp","Save")+"<br><br>"; 
    ts=ts+add_button("To Main","/?page=home")+"<br>";           
  }
  if (page=="clk_settings"){  //тіло сторінки 
    ts=ts+"Current RT ON:"+String(relay_time_on_HR)+"HH <br>"; 
    ts=ts+add_text_field("Relay_timer_ON_HOUR:","relay_time_on_HR","Save")+"<br><br>";  
    ts=ts+"Current RT ON:"+String(relay_time_on_MINS)+"MM <br>"; 
    ts=ts+add_text_field("Relay_timer_ON_MINUTES:","relay_time_on_MINS","Save")+"<br><br>";
    ts=ts+"Current RT OFF:"+String(relay_time_off_HR)+"HH <br>"; 
    ts=ts+add_text_field("Relay_timer_OFF_HOUR:","relay_time_off_HR","Save")+"<br><br>";  
    ts=ts+"Current RT OFF:"+String(relay_time_off_MINS)+"MM <br>"; 
    ts=ts+add_text_field("Relay_timer_OFF_MINUTES:","relay_time_off_MINS","Save")+"<br><br>";   
    ts=ts+add_button("To Main","/?page=home")+"<br>"; 
  }
  if (page=="security_settings"){  //тіло сторінки 
    ts=ts+"Current SECURITY PASSWORD:******** <br>";     
    ts=ts+add_text_field("CHANGE PASSWORD:","new_pass","Save")+"<br><br>";   
    ts=ts+add_button("To Main","/?page=home")+"<br>";    
  }
  if (page=="pins_settings"){  //тіло сторінки 
    ts=ts+"CURRENT PINOUTS FOR SYSTEM <br><br>"; 
    ts=ts+"Current EEPROM SIZE:"+String(eeprom_size)+" <br>"; 
    ts=ts+"Current LED pin:"+String(led_in_pin)+" <br>"; 
    ts=ts+"Current INTERRUPT pin:"+String(interrupt_pin)+" <br>"; 
    ts=ts+"Current BATTERY pin:"+String(battery_in_pin)+" <br>";     
    ts=ts+"Current SENSOR pin:"+String(sensor_in_pin)+" <br>";    
    ts=ts+"Current RELAY pin:"+String(relay_in_pin)+" <br>";     
    ts=ts+"Current ZOOMER pin:"+String(zoomer_pin)+" <br>";      
    ts=ts+"Current TEMPERATURE pin:"+String(ONE_WIRE_BUS_PIN)+" <br>";       
    ts=ts+"Current WIFI_OFF pin:"+String(wifi_off_pin)+" <br>";      
    ts=ts+"Current AP_ON pin:"+String(ap_mode_pin)+" <br>";      
    ts=ts+add_button("To Main","/?page=home")+"<br>";    
  }  
} else {
  if (wrong_password_inputs>0){
  ts=ts+add_text_field("ENTER PASSWORD:","user_pass","Login")+"<br><br>";
  } else {
    ts=ts+"Input blocked, Try later after reboot system!";
  }
}
  //суфікс сторінки
  ts=ts+"<p style=\"background-color:MediumSeaGreen;\" align=\"center\" >";
  ts=ts+"ESP8266 SECURITY  SYSTEM - MAKSYM SVIRCHEVSKYI 2022(c) - VER"+S_version+"["+comp_date+"]";
  ts=ts+"</p>";
  Wserver.send(200,"text/html",ts);  
  }

//відправка листа
int sendmesage(String mes, String url_key, bool std_message){
 WiFiClient client; 
 HTTPClient http;
 int httpResponseCode = -1;
 String serverPath = "";
 if (std_message==false) {serverPath = url_key+mes;} else {serverPath = url_key+"/?value1="+dev_id+"&value2="+mes+"&value3=http://"+WiFi.localIP().toString();}
 Serial.println(serverPath);
 http.begin(client, serverPath.c_str());
 httpResponseCode = http.POST(serverPath);
 if (httpResponseCode>0) {
   Serial.print("HTTP Response code: ");
   Serial.println(httpResponseCode);
   String payload = http.getString();
   Serial.println(payload);}
 else {
  Serial.print("Error code: ");
  Serial.println(httpResponseCode);}
 delay(100);
 http.end(); 
 return  httpResponseCode;   
 }

//=====================ФУНКЦІЇ ТАЙМЕРА==============================

void ICACHE_RAM_ATTR ISR(){
 move_sensor.ReadPin();
 Serial.println("CH_PIN_STATE="+String(move_sensor.dStatus())); 
 led_in.dWrite(!move_sensor.dStatus());
 //relay control
 if (move_sensor.dStatus()==true){relay_on_timer=max_relay_time;} 
 if (relay_setting=="OFF") {relay_on_timer=0;} 
 if (relay_on_timer>0 and relay_setting=="AUTO") {relay_on_timer--; } 
 if (ligth_up==0 and relay_setting=="AUTO") {relay_on_timer=0; }
 if (relay_setting=="ON") {relay_on_timer=max_relay_time;} 
 if (h_temperature>critTemperature) {relay_on_timer=0;}  
 if (relay_on_timer>0){relay_in.dWrite(true); } else {relay_in.dWrite(false);} 
 //messaging
 if (move_sensor.dStatus()==true and secure_status==true and alert<=0) {
 if (sendmesage("ALARM",web_url,true)==200) {alert=alert_timeout; sysOk=sysOk_timeout;}
 }
}

