msvirchevskyi/Secure_Esp8266_Signalization_Public/src/main.cpp
void time_flow_0(){ //1micros
  serial_commands();
  Wserver.handleClient();
  } 
  
void time_flow_1(){ //1millis

  }
  
void time_flow_2(){ //1second 
  c_t_sensors = 0;
  h_temperature = 0;
  float i_vol = battery.backVolts(3.2*3); //h_voltage
  if (i_vol>h_voltage){h_voltage=i_vol;}
  if (i_vol<l_voltage){l_voltage=i_vol;}
  c_t_sensors=sensors.getDeviceCount();
  sensors.requestTemperatures();
  for (int i=0; i<c_t_sensors; i++){
    temperature[i] = sensors.getTempCByIndex(i);
    if (temperature[i]>h_temperature){h_temperature=temperature[i];}    
  }
  timecalculate_unx();
  timecalculate_ntp();
  system_unix_type++; 
  }
  
void time_flow_3(){ //1second
  ligth_up = -1;
  //clock timer  
  int cur_time = (timers[2]*3600)+(timers[1]*60);
  int st_time = (relay_time_on_HR*3600)+(relay_time_on_MINS*60);
  int fin_time = (relay_time_off_HR*3600)+(relay_time_off_MINS*60);
  if (relay_time_on_HR>=0 and relay_time_off_HR>=0 and relay_time_on_MINS>=0 and relay_time_off_MINS>=0){
    ligth_up=0;
    if ((st_time<=fin_time) and (cur_time>st_time) and (cur_time<fin_time)){
      ligth_up=1;
    }
   if ((st_time>fin_time) and ((cur_time>st_time) or (cur_time<fin_time))){ //22/21=+ 22/3=- +| 1/21=- 1/3=+ +| 18/21=- 18/3=- -|
      ligth_up=1;
    }
  }
  //relay control
  if (relay_setting=="OFF") {relay_on_timer=0;} 
  if (relay_on_timer>0 and relay_setting=="AUTO") {relay_on_timer--; } 
  if (ligth_up==0 and relay_setting=="AUTO") {relay_on_timer=0; }
  if (relay_setting=="ON") {relay_on_timer=max_relay_time;}
  if (h_temperature>critTemperature) {relay_on_timer=0;}    
  if (relay_on_timer>0){relay_in.dWrite(true); } else {relay_in.dWrite(false);}   
  //session control
  if (session_timeout>0) {session_timeout--;}
  if (session_timeout==0){user_pass=""; session_timeout=-1;}  
  //power managment
  if (l_voltage<3.7 and last_power_state!=0){last_power_state=0; sendmesage("BATTERY_LOW",web_url,true); delay(10000); ESP.restart(); }
  if ((l_voltage>3.8 and l_voltage<4.4) and last_power_state!=1){last_power_state=1; sendmesage("POWER_OFF",web_url,true);} 
  if ((l_voltage>4.5 and l_voltage<5.9) and last_power_state!=2){last_power_state=2; sendmesage("POWER_ON",web_url,true);} 
  if (l_voltage>6 and last_power_state!=3){last_power_state=3; sendmesage("POWER_OVERLOAD",web_url,true);}   
  //send alarm message
  alert--;
  if (alert<0) {alert=0;}   
  if (move_sensor.dStatus()==true and secure_status==true and alert<=0) {
    if (sendmesage("ALARM",web_url,true)==200) {alert=alert_timeout; sysOk=sysOk_timeout;}
    }   //<<< 
  //send fire message
  fireMsg--;
  if (fireMsg<0) {fireMsg=0;}  
  if (h_temperature>critTemperature and fireMsg<=0) {
    if (sendmesage("FIRE",web_url,true)==200) {fireMsg=fireMsg_timeout; sysOk=sysOk_timeout;}
    }  //<<<
  //send sysOK message
  sysOk--;
  if (sysOk<0) {sysOk=0;}  
  if (sysOk<=0 and secure_status==true) {  
    if (sendmesage("SysOK",web_url,true)>0) {sysOk=sysOk_timeout;} 
    }  //<<<
  //signal system
  if (zoomer_enabled==true and relay_on_timer>0 and secure_status==true) {zoomer.buzzie(1000,500);}
  if (h_temperature>critTemperature) {zoomer.buzzie(1500,800);}   
  Serial.println("System Time:"+String(system_unix_type)+"/Sensor in:"+String(move_sensor.dStatus())+"/off timer:"+String(relay_on_timer)+"/temperature:"+String(h_temperature));
  Serial.println("NTP Time:"+text_time_line); 
  }

//=====================СТАРТОВІ ФУНКЦІЇ=============================

bool connect_to_wifi(String sid,String pid,int rep){
Serial.print("Connecting to ");
WiFi.mode(WIFI_STA);
WiFi.begin(sid,pid);
Serial.println(sid);
for (int i=rep; i>0; i--){
  if (WiFi.status()!=WL_CONNECTED){
    delay(100);
    led_in.dWriteReverse();
    Serial.print(".");
    } else { 
    Serial.println("OK");
    Serial.print("IP:");
    Serial.println(WiFi.localIP()); 
    return true; 
    } 
  } 
led_in.dWrite1();   
return false;  
}

void setup() {
//first init
/*
eEPROM_max_rt.EEPROM_WRITE_SV(20);
eEPROM_sec_enable.EEPROM_WRITE_SV(true);
eEPROM_ssid.EEPROM_WRITE_STRING("SSIDNAME");
eEPROM_pass.EEPROM_WRITE_STRING("SSIDPASS");
eEPROM_web_url.EEPROM_WRITE_STRING("http://maker.ifttt.com/trigger/TRIGGERKEY");
eEPROM_dev_id.EEPROM_WRITE_STRING("DEVICE NAME");
eEPROM_ssid_ap.EEPROM_WRITE_STRING("APSSIDNAME");
eEPROM_pass_ap.EEPROM_WRITE_STRING("APSSIDPASS");
eEPROM_sysok.EEPROM_WRITE_SV(3600*8);
eEPROM_alert.EEPROM_WRITE_SV(60*10);
eEPROM_fire.EEPROM_WRITE_SV(60*10);
eEPROM_crTemp.EEPROM_WRITE_SV(65);
ep_saved_pass.EEPROM_WRITE_STRING("DEFAULTPASSWORD");
ep_relay_time_on_HR.EEPROM_WRITE_SV(-1);
ep_relay_time_on_MINS.EEPROM_WRITE_SV(-1);
ep_relay_time_off_HR.EEPROM_WRITE_SV(-1);
ep_relay_time_off_MINS.EEPROM_WRITE_SV(-1);
*/
//normal init  
Serial.begin(9600);
//enable pins
move_sensor.enable();
led_in.enable();
relay_in.enable();
zoomer.enable();
battery.enable();
wifi_enable.enable();
ap_mode.enable(); 
//power start managment
if (battery.backVolts(3.3*3)<3.7) {delay(10000); ESP.restart(); }
//read memory
saved_pass=ep_saved_pass.EEPROM_READ_STRING();
relay_time_on_HR=ep_relay_time_on_HR.EEPROM_READ_INT();
relay_time_on_MINS=ep_relay_time_on_MINS.EEPROM_READ_INT();
relay_time_off_HR=ep_relay_time_off_HR.EEPROM_READ_INT();
relay_time_off_MINS=ep_relay_time_off_MINS.EEPROM_READ_INT();
max_relay_time=eEPROM_max_rt.EEPROM_READ_INT();
secure_status=eEPROM_sec_enable.EEPROM_READ_BOOL();
web_url=eEPROM_web_url.EEPROM_READ_STRING();
dev_id=eEPROM_dev_id.EEPROM_READ_STRING();
sysOk_timeout=eEPROM_sysok.EEPROM_READ_INT();
alert_timeout=eEPROM_alert.EEPROM_READ_INT();
fireMsg_timeout=eEPROM_fire.EEPROM_READ_INT();
critTemperature=eEPROM_crTemp.EEPROM_READ_INT();
ssid_name=eEPROM_ssid.EEPROM_READ_STRING();
ssid_pass=eEPROM_pass.EEPROM_READ_STRING();
ssid_name_ap=eEPROM_ssid_ap.EEPROM_READ_STRING();
ssid_pass_ap=eEPROM_pass_ap.EEPROM_READ_STRING();
//web services on
wifi_enable.ReadPin();
ap_mode.ReadPin();
sensors.begin();
if (wifi_enable.dStatus()==1){
  if (ap_mode.dStatus()==1){
  connected_to_wifi=connect_to_wifi(ssid_name,ssid_pass,600);
  if (connected_to_wifi==true) {
    timeClient.begin();    
    Wserver.begin();
    Wserver.on("/", html_commands); 
    sendmesage("POWER_UP",web_url,true); 
    soft_ap=false;
    }
  } else {
    WiFi.softAP(ssid_name_ap,ssid_pass_ap);
    Wserver.begin();
    Wserver.on("/", html_commands);  
    soft_ap=true;   
    }
} else {WiFi.mode(WIFI_OFF);}
zoomer.buzzie(2000,500);
sysOk=sysOk_timeout; 
//interrupts
pinMode(interrupt_pin,INPUT);
attachInterrupt(digitalPinToInterrupt(interrupt_pin),ISR,CHANGE);
}

void loop() {
timer0.Tick();
timer1.Tick(); 
timer2.Tick();
timer3.Tick();
}